// Задание 1
// Необходимо с помощью цикла for вывести следующие 11 строк в консоль:
// 0 – это ноль
// 1 – нечетное число
// 2 – четное число
// 3 – нечетное число
// …
// 10 – четное число
// const arr = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// console.log(arr.length);
// for (let i = 0; i < arr.length; i++) {
//     if (arr[i] % 2 == 0) {
//         console.log(`${arr[i]} - Четное число`);
//     } else if (arr[i] % 3 == 0) {
//         console.log(`${arr[i]} - нечетное число`);
//     }
// }



// Задание 2
// Дан массив [1, 2, 3, 4, 5, 6, 7]
// Сделайте из этого массива следующий [1, 2, 3, 6, 7]
// const arr = [1, 2, 3, 4, 5, 6, 7];
// console.log(arr.splice(3, 2));
// console.log(arr);


// Задание 3
// Используя Math.random() вам необходимо генерировать цифры от 0 до 9, и создать массив состоящий из 5 таких элементов
// 1. Рассчитать сумму элементов этого массива
// 2. Найти минимальное число
// 3. Найти есть ли в этом массиве число 3
// const arr = [];
// let size = 5;
// for (let i = 0; i < arr.length; i++) {
//     arr.push(Math.random[i]), 2;
// }
// console.log(arr.length);
// console.log(arr.push(Math.random()));




//оставлю на сладенькое после окончания учебы)
// *Необязательное задание. *
// Необходимо вывести горку в консоль (используя цикл for), как показано на рисунке, только у вашей горки должно быть 20 рядов, а не 5:

// x
// xx
// xxx
// xxxx
// xxxxx
