// Задание 1
// let num1 = Number(prompt("Введите первое число"));
// let num2 = Number(prompt("Введите второе число"));
// let rez1 = (num1 === 1 || num1 < 1) ?
//     console.log("переменная не равна 1") : console.log("переменная меньше 1");
// let rez2 = (num2 === 3 || num2 > 3) ? console.log("переменная больше 3") : console.log("Переменная равна 3");

// Задание 2
// let test1 = Number(prompt("Введите первле число"));
// let test2 = Number(prompt("Введите второе число"));
// (test1 === test2) ? console.log("Числа равны") : console.log("Числа не равны");

// Задание 3
// В переменной day лежит какое-то число из интервала от 1 до 31. Определите в какую декаду месяца попадает это число (в первую, вторую или третью).
// let day = Number(prompt("Введите число от 1 до 31"));
// if (day >= 1 && day <= 10) {
//     console.log("Первая декада");

// } else if (day >= 11 && day <= 20) {
//     console.log("Вторая декада");

// } else if (day >= 21 && day <= 31) {
//     console.log("Третья декада");
// }



// Задание 4 (решить когда закончится обучение- это для себя , как вишенка на торте)
// Необязательное задание. (Если вам показалось домашнее задание простым, выполняем данный пункт)
// (Для решения задания вам потребуется оператор остаток от деления %, например 10%3 === 1 , десять разделить на 3, остаток 1, второй пример 7 % 5, тут остаток от деления будет 2, ну и 3 пример это 14 % 10 === 4, остаток от деления на 10 будет равен 4)

// Необходимо от пользователя получить число.
// Необходимо вывести разряды числа, а именно: количество сотен, десятков и единиц.

// Пример:
// Пользователь ввел число 163. Программа должна вывести:
// "В числе 163 количество сотен: 1, десятков: 6, единиц: 3"

// Пример 2:
// Пользователь ввел число 74. Программа должна вывести:
// "В числе 74 количество сотен: 0, десятков: 7, единиц: 4"

// Пример 3:
// Пользователь ввел число 9537. Программа должна вывести:
// "В числе 9537 количество сотен: 5, десятков: 3, единиц: 7"

// Уточнение: пользователь всегда вводит корректное положительное целое число.
