// 1 Не запуская код, определите, что выведется в консоль:
// console.log(String(true));

// 2 Не запуская код, определите, что выведется в консоль:
// console.log('a' + true);

// 3 Не запуская код, определите, что выведется в консоль:
// console.log(Number(true));

// 4 Не запуская код, определите, что выведется в консоль:
// console.log(true + 1);

// 5 Не запуская код, определите, что выведется в консоль:
// console.log(true + true);

// 6 Не запуская код, определите, что выведется в консоль:
// console.log(true - true);

// 7 Не запуская код, определите, что выведется в консоль:
// console.log(String(true) + Number(true));


